{"format": "keras", "nodes": [{"name": "encoder_input", "id": "encoder_input", "class_name": "InputLayer", "output_shape": [[null, 784]], "num_parameters": 0}, {"name": "encoder", "id": "encoder", "class_name": "Functional", "output_shape": [[null, 2], [null, 2], [null, 2]], "num_parameters": 403972}, {"name": "decoder", "id": "decoder", "class_name": "Functional", "output_shape": [null, 784], "num_parameters": 403728}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 512], "num_parameters": 401920}, {"name": "z_log_var", "id": "z_log_var", "class_name": "Dense", "output_shape": [null, 2], "num_parameters": 1026}, {"name": "z_mean", "id": "z_mean", "class_name": "Dense", "output_shape": [null, 2], "num_parameters": 1026}, {"name": "tf.__operators__.add", "id": "tf.__operators__.add", "class_name": "TFOpLambda", "output_shape": [null, 2], "num_parameters": 0}, {"name": "tf.math.square", "id": "tf.math.square", "class_name": "TFOpLambda", "output_shape": [null, 2], "num_parameters": 0}, {"name": "tf.convert_to_tensor", "id": "tf.convert_to_tensor", "class_name": "TFOpLambda", "output_shape": [null, 784], "num_parameters": 0}, {"name": "tf.cast", "id": "tf.cast", "class_name": "TFOpLambda", "output_shape": [null, 784], "num_parameters": 0}, {"name": "tf.math.subtract", "id": "tf.math.subtract", "class_name": "TFOpLambda", "output_shape": [null, 2], "num_parameters": 0}, {"name": "tf.math.exp", "id": "tf.math.exp", "class_name": "TFOpLambda", "output_shape": [null, 2], "num_parameters": 0}, {"name": "tf.math.squared_difference", "id": "tf.math.squared_difference", "class_name": "TFOpLambda", "output_shape": [null, 784], "num_parameters": 0}, {"name": "tf.math.subtract_1", "id": "tf.math.subtract_1", "class_name": "TFOpLambda", "output_shape": [null, 2], "num_parameters": 0}, {"name": "tf.math.reduce_mean", "id": "tf.math.reduce_mean", "class_name": "TFOpLambda", "output_shape": [null], "num_parameters": 0}, {"name": "tf.math.reduce_sum", "id": "tf.math.reduce_sum", "class_name": "TFOpLambda", "output_shape": [null], "num_parameters": 0}, {"name": "tf.math.multiply", "id": "tf.math.multiply", "class_name": "TFOpLambda", "output_shape": [null], "num_parameters": 0}, {"name": "tf.math.multiply_1", "id": "tf.math.multiply_1", "class_name": "TFOpLambda", "output_shape": [null], "num_parameters": 0}, {"name": "tf.__operators__.add_1", "id": "tf.__operators__.add_1", "class_name": "TFOpLambda", "output_shape": [null], "num_parameters": 0}, {"name": "tf.math.reduce_mean_1", "id": "tf.math.reduce_mean_1", "class_name": "TFOpLambda", "output_shape": [], "num_parameters": 0}, {"name": "add_loss", "id": "add_loss", "class_name": "AddLoss", "output_shape": [], "num_parameters": 0}], "edges": [["encoder_input", "encoder"], ["encoder", "decoder"], ["encoder_input", "dense"], ["dense", "z_log_var"], ["dense", "z_mean"], ["z_log_var", "tf.__operators__.add"], ["z_mean", "tf.math.square"], ["decoder", "tf.convert_to_tensor"], ["encoder_input", "tf.cast"], ["tf.__operators__.add", "tf.math.subtract"], ["tf.math.square", "tf.math.subtract"], ["z_log_var", "tf.math.exp"], ["tf.convert_to_tensor", "tf.math.squared_difference"], ["tf.cast", "tf.math.squared_difference"], ["tf.math.subtract", "tf.math.subtract_1"], ["tf.math.exp", "tf.math.subtract_1"], ["tf.math.squared_difference", "tf.math.reduce_mean"], ["tf.math.subtract_1", "tf.math.reduce_sum"], ["tf.math.reduce_mean", "tf.math.multiply"], ["tf.math.reduce_sum", "tf.math.multiply_1"], ["tf.math.multiply", "tf.__operators__.add_1"], ["tf.math.multiply_1", "tf.__operators__.add_1"], ["tf.__operators__.add_1", "tf.math.reduce_mean_1"], ["tf.math.reduce_mean_1", "add_loss"]]}